const temp = [
  //https://ja.wikipedia.org/wiki/%E4%B8%AD%E5%A4%AE%E3%82%A2%E3%83%95%E3%83%AA%E3%82%AB%E5%85%B1%E5%92%8C%E5%9B%BD%E3%81%AE%E9%83%BD%E5%B8%82%E3%81%AE%E4%B8%80%E8%A6%A7
  "バンギ", "ビンボ", "ベルベラティ", "マンベレ・カデイ",
  "カルノ", "マンベレ", "ブリア", "コト", "バンバリ",
  "ワカ", "ノラ", "サンガ・ムバエレ", "ブワル", "ナナ・メンベレ",
  "ボサンゴア", "ウハム", "バンガスー", "ムボム", "オボ",
  "ゼミオ", "ボズム", "モバイエ", "ヤリンガ", "ラファイ",
  "ベグア", "ビラオ", "ンデレ",

  //https://ja.wikipedia.org/wiki/%E4%B8%AD%E5%A4%AE%E3%82%A2%E3%83%95%E3%83%AA%E3%82%AB%E5%85%B1%E5%92%8C%E5%9B%BD%E3%81%AE%E8%A1%8C%E6%94%BF%E5%8C%BA%E7%94%BB
  "バミンギ・バンゴラン", "ンデレ", "バンギ", "バス・コト",
  "モバイエ", "オート・コト", "ブリア", "オー・ムボム", "オボ",
  "ケモ", "シブツ", "リム・ペンデ", "パウア", "ロバイエ",
  "ムバイキ", "マンベレ", "カルノ", "マンベレ・カデイ", "ベルベラティ",
  "ムボム", "バンガスー", "ナナ・グリビジ", "カガ＝バンドロ", "ナナ・メンベレ",
  "ブワル", "オンベラ・ムポコ", "ボアリ", "ワカ", "バンバリ",
  "ウハム", "ボサンゴア", "ウハム・ファファ", "バタンガフォ", "ウハム・ペンデ",
  "ボズム", "サンガ・ムバエレ", "ノラ", "バカガ", "ビラオ",
  "ビンボ",
];

const list = [...new Set(temp).keys()];

export { list as centralAfricanRepublic };