const temp = [
  //https://ja.wikipedia.org/wiki/%E3%82%A8%E3%82%B9%E3%83%AF%E3%83%86%E3%82%A3%E3%83%8B%E3%81%AE%E9%83%BD%E5%B8%82%E3%81%AE%E4%B8%80%E8%A6%A7
  "マンジニ", "ムババーネ", "ホホ", "ロバンバ",
  "ビッグ・ベンド", "ルボンボ", "ンランガーノ", "シセルウェニ", "ムルメ",
  "シテキ", "ピッグズ・ピーク", "ハラティクル", "ラブミサ", "ヌグウェニャ",
  "マンカヤネ",

  //https://ja.wikipedia.org/wiki/%E3%82%A8%E3%82%B9%E3%83%AF%E3%83%86%E3%82%A3%E3%83%8B%E3%81%AE%E8%A1%8C%E6%94%BF%E5%8C%BA%E7%94%BB
  "ホホ", "ムババーネ", "マンジニ", "ルボンボ",
  "シテキ", "シセルウェニ", "ンランガーノ", "ブレーマースドルプ", "マンカイネ",
  "ピッグズ・ピーク", "ロバンバ", "ムルメ", "ゲゲ", "ホセア",
  "クブタ", "ラブミサ", "スワジ", "フクウィニ", "マドランゲンピシ",
  "マイワネ", "ムランガタネ", "モチャン", "ムパラレニ", "ンジンゲニ",
  "ンカバ", "ントフォンジェニ", "ティンピシニ", "シポコシニ", "エクカンイェニ",
  "クワルセニ", "ラムガビ", "ルゼルゼルゼ", "マフツェニ", "マフランガチャ",
  "マハラニャ", "マンゴンゴ", "ムランバニャツィ", "ムキウェニ", "ムトンガネニ",
  "ングウェンピシ", "ンランベニ", "ンコミヤラバ", "ントンドジ", "フォンド",
  "ドヴォコドヴェニ", "ギルガル", "ロマハシャ", "ルブリ", "ルゴンゴ",
  "マランパ", "マツァンジェニ", "ムバンガ", "シフォファネニ", "ティサネニ",
  "ルンジ", "ルビンゴ", "ンクウェネ", "ムバンゲニ", "ムロシェニ",
  "ムフメ",
];

const list = [...new Set(temp).keys()];

export { list as eswatini };