const temp = [
  //出典：https://ja.wikipedia.org/wiki/%E3%82%B8%E3%83%A7%E3%83%BC%E3%82%B8%E3%82%A2%E3%81%AE%E9%83%BD%E5%B8%82%E3%81%AE%E4%B8%80%E8%A6%A7
  "トビリシ", "バトゥミ", "アジャリア", "クタイシ",
  "イメレティ", "ルスタヴィ", "クヴェモ・カルトリ", "スフミ", "アブハジア",
  "ゴリ", "シダ・カルトリ", "ズグディディ", "サメグレロ＝ゼモ・スヴァネティ", "ポティ",
  "ツヒンヴァリ", "オセチア", "ハシュリ", "アハルカラキ", "アハルツィヘ",
  "オズルゲティ", "ガグラ", "ガリ", "グダウタ", "コブレチ",
  "シグナギ", "ゼスタポニ", "セナキ", "チアトゥラ", "チャルトゥボ",
  "テラヴィ", "トゥクヴァルチェリ", "ボルジョミ", "ムツヘタ", "アンブロラウリ",
  "サムトレディア", "サガレジョ", "サガレホ", "ガルダバニ", "トキブリ",
  "ホニ", "ボルニシ", "グルジャアニ", "アフメタ",

  //出典：https://ja.wikipedia.org/wiki/%E3%82%B8%E3%83%A7%E3%83%BC%E3%82%B8%E3%82%A2%E5%9B%BD%E3%81%AE%E8%A1%8C%E6%94%BF%E5%8C%BA%E7%94%BB
  "アブハジア", "スフミ", "サメグレロ＝ゼモ・スヴァネティ", "ズグディディ",
  "グリア", "オズルゲティ", "アジャリア", "バトゥミ", "ラチャ＝レチフミ",
  "クヴェモ・スヴァネティ", "アンブロラウリ", "イメレティ", "クタイシ", "サムツヘ＝ジャヴァヘティ",
  "アハルツィヘ", "シダ・カルトリ", "オセチア", "ゴリ", "ムツヘタ＝ムティアネティ",
  "ムツヘタ", "クヴェモ・カルトリ", "ルスタヴィ", "カヘティ", "テラヴィ",
  "トビリシ", "アジャラ", "ツヒンヴァリ",
];

const list = [...new Set(temp).keys()];

export { list as georgia };