const temp = [
  //出典：https://ja.wikipedia.org/wiki/%E3%82%AE%E3%83%8B%E3%82%A2%E3%81%AE%E9%83%BD%E5%B8%82%E3%81%AE%E4%B8%80%E8%A6%A7
  "コナクリ", "ンゼレコレ", "ゲケドゥ", "カンカン",
  "キンディア", "カムサル", "ボケ", "キシドゥグ", "ファラナ",
  "マセンタ", "サンガレディ", "マムー", "シギリ", "フォレカリア",
  "フリア", "ベイラ", "ボッファ", "マリ", "ラベ",

  //出典：https://ja.wikipedia.org/wiki/%E3%82%AE%E3%83%8B%E3%82%A2%E3%81%AE%E8%A1%8C%E6%94%BF%E5%8C%BA%E7%94%BB
  "ボケ", "コナクリ", "ファラナ", "カンカン",
  "キンディア", "ラベ", "マムー", "ンゼレコレ", "ベイラ",
  "ボッファ", "コヤ", "ダボラ", "ダラバ", "ダンギレ",
  "ドュブレカ", "ドゥブレカ", "フォレカリア", "フリア", "ガワル",
  "ゲケドゥ", "ケルワヌ", "キシドゥグ", "クビア", "クンダラ",
  "クールーサ", "レルーマ", "ローラ", "マセンタ", "マリ",
  "マンディアナ", "ピタ", "シギリ", "テリメレ", "トゥゲ",
  "ヨムー",

];

const list = [...new Set(temp).keys()];

export { list as guinea };