const temp = [
  //出典：https://ja.wikipedia.org/wiki/%E3%83%9E%E3%83%AA%E5%85%B1%E5%92%8C%E5%9B%BD%E3%81%AE%E9%83%BD%E5%B8%82%E3%81%AE%E4%B8%80%E8%A6%A7
  "バマコ", "シカソ", "カラバンコロ", "クリコロ",
  "カティ", "クーティアラ", "セグー", "カイ", "モプティ",
  "ニオノ", "ガオ", "キダル", "クアクロウ", "ジェンネ",
  "タウデニ", "トンブクトゥ", "ナラ", "ニオロ・デュ・サヘル",

  //出典：https://ja.wikipedia.org/wiki/%E3%83%9E%E3%83%AA%E5%85%B1%E5%92%8C%E5%9B%BD%E3%81%AE%E5%9C%B0%E6%96%B9%E8%A1%8C%E6%94%BF%E5%8C%BA%E7%94%BB
  "バフーラベ", "バマコ", "コロカニ", "クリコロ",
  "バンディアガラ", "ドゥエンツァ", "ブグニ", "ガオ", "アンソンゴ",
  "メナカ", "グンダム", "グルマ", "グルマ＝ラロー", "カイ",
  "キタ", "クーティアラ", "マシーナ", "モプティ", "ジェンネ",
  "ナラ", "ムルディア", "ネマ", "ティンベドラ", "ニアフンケ",
  "ニオロ", "イェリマネ", "サン", "サタドゥグー", "セグー",
  "シカソ", "トンブクトゥ", "ブーレム", "キダル", "ニオロ・デュ・サヘル",
  "カティ", "タウデニ", "ディオイラ", "ケニエバ", "アンビデディ",
  "アウルー", "ディアムー", "ウッスビディアガナ", "セガラ", "サディオラ",
  "バナンバ", "カンガバ", "ニャミナ", "シビー", "ネゲラ",
  "カディオロ", "ダンデレッソ", "キニャン", "ケレラ", "ロブーグーラ",
  "ルールーニ", "ニエナ", "ブラ", "バルーエリ", "ニオノ",
  "ディオロ", "ファラコ", "ナムパラ", "ソコロ", "マルカラ",
  "サロ", "テネンクー", "ユーワルー", "コンナ", "コリヤンゼ",
  "ソファラ", "トゴレ＝クンベ", "ディレ", "バンタグーグー", "サラフェレ",
  "バンバラ＝マウーデ", "レレー", "ゴシ", "トンカ", "ベール",
  "ガルガンド", "アルムストラ", "バンバ", "ワーアッタグーナ", "ソニ・アリベル",
  "ジュボック", "タラテイエ", "テッシ", "ンティリット", "ガベロ",
  "エルサネ", "タバンコール", "タンアウケー", "カサンベレ", "アベイバラ",
  "タンエサッコ", "テッサリト", "アチボゴ", "アネフィフ", "ティメトリンヌ",
  "アゲルホク", "タカロテ", "アラウアンヌ", "フーム・アルバ", "ブージェ＝ベア",
  "アル＝ウーシェ", "アシュラト", "ティダメヌ", "イネカール", "オンドラムブーカーヌ",
  "アヌザグレーネ", "インラマワネ", "ニオロ・デュ・サエル", "ディーマ", "ディアングーンテ・カマラ",
  "サンダレ", "トロングーンベ", "ベマ", "サガバリ", "セベコロ",
  "トゥーコト", "セフェト", "シラコロ", "バンコ", "ベレコ",
  "ファナ", "マッシグイ", "メナ", "バレ", "ディリー",
  "ムールディアー", "ギレ", "ファルー", "ヤンフォリラ", "コロンディーバ",
  "ガラロ", "クーマントゥー", "セリンゲ", "ウエレッセブーグー", "カディアナ",
  "ファコラ", "ドゴ", "ヨロッソ", "ンペッソバ", "モロバラ",
  "クーリー", "コンセゲラ", "クーニアナ", "ザンガッソ", "トミニアン",
  "キンパラナ", "ヤンガッソ", "ファンガッソ", "マンディアキュイ", "シイ",
  "ボレ", "オンボリ", "ングマ", "モンドロ", "ボニ",
  "コロ", "バンカス", "ケンディー", "ニンガリ", "ディアルッサグー",
  "サンガー", "カニ", "ソコーラ",
];

const list = [...new Set(temp).keys()];

export { list as mali };