
const temp = [

  "ピョンヤン", "ハムフン", "チョンジン", "シニジュ",
  "ウォンサン", "ナムポ", "サリウォン", "ケソン", "カンゲ",
  "スンチョン",

  //https://ja.wikipedia.org/wiki/%E5%B9%B3%E5%A3%8C%E5%B8%82
  "チュングヨク", "ピョンチョングヨク", "ポトンガングヨク", "モランボングヨク",
  "ソソングヨク", "ソンギョグヨク", "トンデウォングヨク", "テドンガングヨク", "サドングヨク",
  "テソングヨク", "マンギョンデグヨク", "ヒョンジェサングヨク", "リョンソングヨク", "サムソックヨク",
  "リョクポグヨク", "ランナングヨク", "スナングヨク", "ウンジョングヨク", "ファソングヨク",
  "カンドングン", "カンナムグン",

  //https://ja.wikipedia.org/wiki/%E4%B8%AD%E5%8C%BA%E5%9F%9F
  "キョンニムドン", "キョンサンドン", "キョグドン", "テドンムンドン",
  "トンソンドン", "トンアンドン", "トンフンドン", "リョナイルトン", "リョナイドン",
  "リュソンドン", "マンスドン", "ポトンムンドン", "ソムンドン", "ソチャンドン",
  "ヨクチョンドン", "オタンドン", "ウェソンドン", "チョンノドン", "チュンソンドン",
  "チャングァンドン", "ヘバンサンドン", "キョンルドン",

  //https://ja.wikipedia.org/wiki/%E5%B9%B3%E5%B7%9D%E5%8C%BA%E5%9F%9F
  "カンソンドン", "リュッキョイルトン", "リュッキョイドン", "ポンナムドン",
  "ポンジドン", "ポンハクトン", "プクソンイルトン", "プクソンイドン", "セマウル",
  "セマウリルトン", "セマウリドン", "アンサニルトン", "アンサニドン", "チョンピョンドン",
  "ピョンチョニルトン", "ピョンチョニドン", "ヘウニルトン", "ヘウニドン",

  //https://ja.wikipedia.org/wiki/%E6%99%AE%E9%80%9A%E6%B1%9F%E5%8C%BA%E5%9F%9F
  "キョンフンドン", "テボドン", "ラゴンドン", "リュギョンイルトン",
  "リュギョンイドン", "ポトンガンイルトン", "ポトンガンイドン", "ポンファドン", "プルグンゴリ",
  "プルグンゴリイルトン", "プルグンゴリイドン", "プルグンゴリサムドン", "ソジャンドン", "ソガムドン",
  "セゴリ", "セゴリドン", "シノンドン",

  //https://ja.wikipedia.org/wiki/%E7%89%A1%E4%B8%B9%E5%B3%B0%E5%8C%BA%E5%9F%9F
  "ケソンドン", "キンマウル", "キンマウリルトン", "キンマウリドン",
  "ミヌンドン", "プクセドン", "ピパイルトン", "ピパイドン", "ソフンドン",
  "ソンブクトン", "ウォリャンドン", "イヌンイルトン", "イヌンイドン", "チャンヒョンドン",
  "チョンスンドン", "チョヌドン", "チヌンドン", "フンブドン",

  //https://ja.wikipedia.org/wiki/%E8%A5%BF%E5%9F%8E%E5%8C%BA%E5%9F%9F
  "キンジェ", "キンジェドン", "ナムギョドン", "モッ",
  "リョンモットン", "サンシンドン", "サンフンドン", "ソサニルトン", "ソサニドン",
  "ソチョンドン", "ソクポンドン", "ワサンドン", "チャンギョンイルトン", "チャンギョンイドン",
  "チャンサンドン", "チュンシンドン", "ハシンドン",

  //https://ja.wikipedia.org/wiki/%E8%88%B9%E6%A9%8B%E5%8C%BA%E5%9F%9F
  "カンアニルトン", "カンアニドン", "ナムシニルトン", "ナムシニドン",
  "テフンドン", "トゥンメ", "トゥンメイルトン", "トゥンメイドン", "トゥンメサムドン",
  "リュルゴギルトン", "リュルゴギドン", "ムジニルトン", "ムジニドン", "サノビルトン",
  "サノビドン", "ソンギョイルトン", "ソンギョイドン", "ソンギョサムドン", "ヨンジェドン",
  "ウンメ", "ウンメドン", "チャンチュンイルトン", "チャンチュンイドン",

  //https://ja.wikipedia.org/wiki/%E6%9D%B1%E5%A4%A7%E9%99%A2%E5%8C%BA%E5%9F%9F
  "テシンドン", "トンデウォニルトン", "トンデウォニドン", "トンシニルトン",
  "トンシニドン", "トンシンサムドン", "レンチョニルトン", "レンチョニドン", "リュルトン",
  "ムンシニルトン", "ムンシニドン", "サンマイルトン", "サンマイドン", "セサルリム",
  "セサルリムドン", "シルリドン", "シヌンイルトン", "シヌンイドン", "シヌンサムドン",

  //https://ja.wikipedia.org/wiki/%E5%A4%A7%E5%90%8C%E6%B1%9F%E5%8C%BA%E5%9F%9F
  "テドンガンドン", "トンムニルトン", "トンムニドン", "ルンナイルトン",
  "ルンナイドン", "ムンスイルトン", "ムンスイドン", "ムンスサムドン", "ムヌンイルトン",
  "ムヌンイドン", "プクスドン", "サゴギルトン", "サゴギドン", "ソリョンイルトン",
  "ソリョンイドン", "オンニュイルトン", "オンニュイドン", "オンニュサムドン", "ウィアムドン",
  "チョンニュイルトン", "チョンニュイドン", "チョンニュサムドン", "タプチェイルトン", "タプチェイドン",
  "タプチェサムドン",

  //https://ja.wikipedia.org/wiki/%E5%AF%BA%E6%B4%9E%E5%8C%BA%E5%9F%9F
  "ナムサンドン", "トゥルイルトン", "トゥルイドン", "ミリムドン",
  "コル", "サムコルトン", "ソクチョンドン", "ソンシニルトン", "ソンシニドン",
  "ソンシンサムドン", "ソンファイルトン", "ソンファイドン", "チャンチョンドン", "ヒュアムドン",
  "クムタンニ", "テウォンニ", "トクトンニ", "トンチャンニ", "リヒョンニ",
  "オリュリ",

  //https://ja.wikipedia.org/wiki/%E5%A4%A7%E5%9F%8E%E5%8C%BA%E5%9F%9F
  "カンムンドン", "コサンドン", "テソンドン", "リョンナムドン",
  "リョンブクトン", "リョンフンイルトン", "リョンフンイドン", "リョンフンサムドン", "リムンドン",
  "ミサニルトン", "ミサニドン", "ミアムドン", "アナクトン", "チョンアムドン",
  "チョンホドン",

  //https://ja.wikipedia.org/wiki/%E4%B8%87%E6%99%AF%E5%8F%B0%E5%8C%BA%E5%9F%9F
  "カルリムキル", "カルリムキリルトン", "カルリムキリドン", "コングクトン",
  "クァンボギルトン", "クァンボギドン", "クムソンイルトン", "クムソンイドン", "クムソンサムドン",
  "クムチョンドン", "タンサンイルトン", "タンサンイドン", "テピョンドン", "リョンサンドン",
  "リョンアクサンドン", "マンギョンデドン", "サムンドン", "ソサンドン", "ソングジャドン",
  "ソンネドン", "チャンフニルトン", "チャンフニドン", "チャンフンサムドン", "チュクチョニルトン",
  "チュクチョニドン", "コル", "チルコリルトン", "チルコリドン", "チルコルサムドン",
  "パルコリルトン", "パルコリドン", "リョンボンニ", "ウォルロリ",

  //https://ja.wikipedia.org/wiki/%E5%85%84%E5%BC%9F%E5%B1%B1%E5%8C%BA%E5%9F%9F
  "サンダンドン", "ソリョンドン", "ソサンドン", "ソポイルトン",
  "ソポイドン", "ソポサムドン", "ソクチョンドン", "シンガニルトン", "シンガニドン",
  "シンガンサムドン", "シンミドン", "チョヌィイルドン", "チョヌィイドン", "チュンダンドン",
  "ハダンイルトン", "ハダンイドン", "ハクサンドン", "チェサンニ", "チョンナムニ",
  "ヒョンサンニ",

  //https://ja.wikipedia.org/wiki/%E9%BE%8D%E5%9F%8E%E5%8C%BA%E5%9F%9F
  "テチョンドン", "リョングンイルトン", "リョングンイドン", "リョンムンドン",
  "リョンソンイルトン", "リョンソンイドン", "リョンチュイルトン", "リョンチュイドン", "リモンドン",
  "マサンドン", "ミョンオドン", "オウンドン", "チュンイドン", "チョンゲドン",

  //https://ja.wikipedia.org/wiki/%E4%B8%89%E7%9F%B3%E5%8C%BA%E5%9F%9F
  "ムニョンドン", "ソンムニルトン", "ソンムニドン", "チャンスウォンドン",
  "クァンドンニ", "トドンニ", "サムソンニ", "ウォンシンニ", "ウォヌンニ",
  "ホナムニ",

  //https://ja.wikipedia.org/wiki/%E5%8A%9B%E6%B5%A6%E5%8C%BA%E5%9F%9F
  "ヌングム", "ヌングムドン", "テヒョンドン", "リョクポドン",
  "ソシンドン", "チャンジニルトン", "チャンジニドン", "リョンサンニ", "リュヒョンニ",
  "セウムル", "セウムルリ", "ソサムジョンニ", "ヤンウムニ", "チュダンニ",

  //https://ja.wikipedia.org/wiki/%E6%A5%BD%E6%B5%AA%E5%8C%BA%E5%9F%9F
  "クァンムニルトン", "クァンムニドン", "クァンムンサムドン", "トンサンドン",
  "トゥダンドン", "ランナンイルトン", "ランナンイドン", "ランナンサムドン", "スンニイルトン",
  "スンニイドン", "スンニサムドン", "ウォナムドン", "チョンベギルトン", "チョンベギドン",
  "チョンオイルトン", "チョンオイドン", "チュンソンイルトン", "チュンソンイドン", "チュンソンサムドン",
  "ゴリ", "トンイルゴリイルトン", "トンイルゴリイドン", "クムデリ", "キンコル",
  "キンコルリ", "ナムサリ", "リョンホリ", "リュソリ", "ピョクチドリ",
  "ポソンニ", "ソンナムニ", "チュンダンニ",

  //https://ja.wikipedia.org/wiki/%E9%A0%86%E5%AE%89%E5%8C%BA%E5%9F%9F
  "ナムサンドン", "テヤンドン", "ソクパクトン", "シンソンドン",
  "ヨクチョンドン", "クソリ", "トンサンニ", "リョンボンニ", "サニャンニ",
  "オサンニ", "アヌンニ", "チェギョンニ", "チョンドンニ", "テガムニ",

  //https://ja.wikipedia.org/wiki/%E6%81%A9%E6%83%85%E5%8C%BA%E5%9F%9F
  "クァハギルトン", "クァハギドン", "クァンミョンドン", "ペサンドン",

  //https://ja.wikipedia.org/wiki/%E5%92%8C%E7%9B%9B%E5%8C%BA%E5%9F%9F
  "ファソンイルドン", "ファソンイドン", "ファソンサムドン", "ファウォンイルドン",
  "ファウォンイドン", "クムヌンイルドン", "クムヌンイドン", "チョンファイルドン",

  //https://ja.wikipedia.org/wiki/%E6%B1%9F%E6%9D%B1%E9%83%A1
  "カンドンウプ", "コビロドンジャグ", "ナムガンノドンジャグ", "テリロドンジャグ",
  "リョンナムノドンジャグ", "サンニロドンジャグ", "ソクチュロドンジャグ", "ソンガロドンジャグ", "ハリロドンジャグ",
  "フンニョンノドンジャグ", "クビンニ", "トンニ", "ランサンニ", "リョンフンニ",
  "メクチョンニ", "ミョンイリ", "ムナリ", "ムヌンニ", "ポンファリ",
  "サムドゥンニ", "ソンソンニ", "スンチャンニ", "テジャムニ", "ヒャンモンニ",
  "ファガンニ",

  //https://ja.wikipedia.org/wiki/%E6%B1%9F%E5%8D%97%E9%83%A1
  "カンナムプ", "カンチョンニ", "コウムニ", "コチョンニ",
  "タンゴンニ", "トンジョンニ", "リョンゴンニ", "リョンギョリ", "リョンポリ",
  "リュポリ", "マジョンニ", "ムナムニ", "サンアムニ", "ソコリ",
  "シンジョンニ", "シヌンニ", "ヨンジンニ", "イサンニ", "チャンギョリ",

  //https://ja.wikipedia.org/wiki/%E6%9C%9D%E9%AE%AE%E6%B0%91%E4%B8%BB%E4%B8%BB%E7%BE%A9%E4%BA%BA%E6%B0%91%E5%85%B1%E5%92%8C%E5%9B%BD%E3%81%AE%E5%9C%B0%E6%96%B9%E8%A1%8C%E6%94%BF%E5%8C%BA%E7%94%BB
  "ピョンヤン=ジカルシ", "チュン=グヨㇰ", "ピョンチョン=グヨㇰ", "ポトンガン=グヨㇰ",
  "モランボン=グヨㇰ", "ソソン=グヨㇰ", "ソンギョ=グヨㇰ", "トンデウォン=グヨㇰ", "テドンガン=グヨㇰ",
  "サドン=グヨㇰ", "テソン=グヨㇰ", "マンギョンデ=グヨㇰ", "ヒョンジェサン=グヨㇰ", "リョンソン=グヨㇰ",
  "サムソㇰクヨㇰ", "リョㇰポ=グヨㇰ", "ランナン=グヨㇰ", "スナン=グヨㇰ", "ウンジョン=グヨㇰ",
  "ファソン=グヨㇰ", "カンドン=グン", "カンナム=グン", "パンヒョン=ドン", "ラソン=トゥㇰピョルシ",
  "ナンポ=トゥㇰピョルシ", "カンソ=グヨㇰ", "テアン=グヨㇰ", "ワウド=グヨㇰ", "チョルリマ=グヨㇰ",
  "ハング=グヨㇰ", "オンチョン=グン", "リョンガン=グン", "ケソン=トゥㇰピョルシ", "ケプン=グヨㇰ",
  "パンムン=グヨㇰ", "チャンプン=グン", "ピョンアンナム=ド", "ピョンソン=シ", "アンジュ=シ",
  "ケチョン=シ", "スンチョン=シ", "トㇰチョン=シ", "テドン=グン", "チュンサン=グン",
  "ピョンウォン=グン", "ムンドㇰ=グン", "スㇰチョン=グン", "ソンチョン=グン", "ニョンウォン=グン",
  "プㇰチャン=グン", "メンサン=グン", "ヤンドㇰ=グン", "フェチャン=グン", "シニャン=グン",
  "テフン=グン", "ウンサン=グン", "チョンナム=グ", "トゥㇰチャン=ジグ", "ピョンアンブㇰ=ト",
  "シニジュ=シ", "クソン=シ", "チョンジュ=シ", "チャンソン=グン", "ピヒョン=グン",
  "リョンチョン=グン", "ヨムジュ=グン", "チョルサン=グン", "トンニム=グン", "ソンチョン=グン",
  "クァㇰサン=グン", "ウンジョン=グン", "パㇰチョン=グン", "ニョンビョン=グン", "クジャン=グン",
  "ヒャンサン=グン", "ウンサン=グン", "テチョン=グン", "チョンマ=グン", "ウィジュ=グン",
  "サㇰチュ=グン", "テグァン=グン", "トンチャン=グン", "ピョㇰトン=グン", "シンド=グン",
  "チャガン=ド", "カンゲ=シ", "マンポ=シ", "ヒチョン=シ", "チャンガン=グン",
  "シジュン=グン", "チャソン=グン", "チュンガン=グン", "ウィウォン=グン", "チョサン=グン",
  "ウシ=グン", "コプン=グン", "ソンウォン=グン", "ソンガン=グン", "チョンチョン=グン",
  "リョンニム=グン", "ファピョン=グン", "トンシン=グン", "ランニム=グン", "リャンガン=ド",
  "ヘサン=シ", "サムジヨン=シ", "ウヌン=グン", "ポチョン=グン", "テホンダン=グン",
  "ペガム=グン", "カプサン=グン", "キミョンジㇰ=グン", "キムジョンスㇰ=グン", "キミョングォン=グン",
  "プンソ=グン", "サムス=グン", "ファンヘナム=ド", "ヘジュ=シ", "ピョㇰソン=グン",
  "カンニョン=グン", "オンジン=グン", "テタン=グン", "チャンヨン=グン", "リョンヨン=グン",
  "サムチョン=グン", "ソンファ=グン", "クァイル", "クァイル=グン", "ウンニュル=グン",
  "ウンチョン=グン", "アナㇰ=グン", "シンチョン=グン", "チェリョン=グン", "ポンチョン=グン",
  "ペチョン=グン", "シヌォン=グン", "ヨナン=グン", "チョンダン=グン", "ファンヘブㇰ=ト",
  "サリウォン=シ", "ソンニム=シ", "ファンジュ=グン", "ポンサン=グン", "ヨンタン=グン",
  "ウンパ=グン", "ソフン=グン", "ピョンサン=グン", "クムチョン=グン", "リンサン=グン",
  "トサン=グン", "シンゲ=グン", "コㇰサン=グン", "ヨンサン=グン", "シンピョン=グン",
  "スアン=グン", "チュンファ=グン", "サンウォン=グン", "スンホ=グン", "ハムギョンナム=ド",
  "ハムン=シ", "フンナム=グヨㇰ", "フェサン=グヨㇰ", "ヘアン=グヨㇰ", "サポ=グヨㇰ",
  "フンドㇰ=グヨㇰ", "トンフンサン=グヨㇰ", "ソンチョンガン=グヨㇰ", "シンポ=シ", "タンチョン=シ",
  "ハムジュ=グン", "ラグォン=グン", "チョンピョン=グン", "クミャ=グン", "コウォン=グン",
  "ヨドㇰ=グン", "チャンジン=グン", "プジョン=グン", "ヨングァン=グン", "シヌン=グン",
  "ホンウォン=グン", "プㇰチョン=グン", "トㇰソン=グン", "リウォン=グン", "ホチョン=グン",
  "スドン=グン", "クモ=ジグ", "ハムギョンブㇰ=ト", "チョンジン=シ", "シナム=グヨㇰ",
  "ポハン=グヨㇰ", "チョンアム=グヨㇰ", "スナム=グヨㇰ", "ソンピョン=グヨㇰ", "ラナム=グヨㇰ",
  "プユン=グヨㇰ", "キムチェㇰ=シ", "フェリョン=シ", "プリョン=グン", "ムサン=グン",
  "キョンソン=グン", "キルチュ=グン", "ファデ=グン", "ミョンチョン=グン", "ミョンガン=グン",
  "オラン=グン", "ヨンサ=グン", "オンソン=グン", "キョンウォン=グン", "キョンフン=グン",
  "カンウォン=ド", "ウォンサン=シ", "ムンチョン=シ", "チョンネ=グン", "アンビョン=グン",
  "コサン=グン", "トンチョン=グン", "コソン=グン", "クムガン=グン", "チャンド=グン",
  "キムァ=グン", "フェヤン=グン", "セポ=グン", "ピョンガン=グン", "チョルォン=グン",
  "イチョン=グン", "パンギョ=グン", "ポプトン=グン", "シニジュ=トゥクピョルヘンジョング", "ケソン=ゴンオプジグ",
  "ラソン=キョンジェトゥクグ", "ガンナム=キョンジェトゥクグ", "ウォンサン-カルマ=ヘアムクァングァンジグ",
];

const list = [...new Set(temp).keys()];

export { list as northKorea };  