const temp = [
  //https://ja.wikipedia.org/wiki/%E3%82%A6%E3%82%BA%E3%83%99%E3%82%AD%E3%82%B9%E3%82%BF%E3%83%B3%E3%81%AE%E9%83%BD%E5%B8%82%E3%81%AE%E4%B8%80%E8%A6%A7
  "タシュケント", "チルチク", "アングレン", "ベカバード",
  "アルマリク", "ヤンギユル", "パルケント", "アハンガラン", "ピスケント",
  "キブライ", "イスカンダル", "サラール", "ウズベク", "ベクテミール",
  "アルマザール", "ガザルケント", "チナズ", "ヤンギアーバード", "トイテパ",
  "ブカ", "ソルダツキ", "ウルターウル", "クラスノゴルスキー", "アンディジャン",
  "シャフリハン", "アサカ", "ハナバード", "ハックラーバード", "クルガンテパ",
  "カラスウ", "パイトゥグ", "パフターバード", "バズ", "ホジャーバード",
  "マルハマト", "アフンババイェフ", "ブハラ", "カガン", "ギジュドゥヴァン",
  "シャフィルカン", "カラクル", "ヴァブケント", "ガラーシヤ", "ロミタン",
  "アラト", "ガズリ", "カラウールバザール", "ジザフ", "ザーミン",
  "ガガーリン", "ガルリャアラル", "パフタコール", "ダシュタバード", "ドゥストリク",
  "マルジャンブラク", "フェルガナ", "コーカンド", "マルギラン", "クヴァ",
  "クヴァサイ", "リシタン", "タシュラク", "アルティアリク", "ベシャリク",
  "ヤイパン", "ハムザ", "ホラズム", "ウルゲンチ", "ヒヴァ",
  "ハンカ", "グルレン", "シャヴァト", "ハザラスプ", "コシュコピル",
  "ナマンガン", "チュスト", "チャルタク", "カサンサイ", "ウチュクルガン",
  "ウイチ", "ヤンギクルガン", "トゥラクルガン", "パプ", "ナヴォイ",
  "ザラフシャン", "ウチュクドゥク", "ヌラタ", "カルマナ", "キズィルテパ",
  "サマルカンド", "カッタクルガン", "ウルグト", "アクタシュ", "ブルングル",
  "ヤンギラーバード", "パイシャンバ", "ジュマ", "ジアディン", "チェレク",
  "ジャムバイ", "チャルヒン", "イシュティハン", "ヌラバード", "シルダリヤ",
  "グリスタン", "ヤンギイェル", "ハヴァス", "シリン", "バフト",
  "スルハンダリヤ", "テルメズ", "デナウ", "ジャルクルガン", "シェラバード",
  "バイスン", "シュルチ", "サリアシヤ", "クムクルガン", "アククルガン",
  "シャルグン", "カシュカダリヤ", "カルシ", "シャフリサブス", "カサン",
  "キタブ", "カマシ", "ムバレク", "ヤッカバグ", "グザル",
  "チラクチ", "ベシュケント", "マイマナク", "ヤンギ・ニシャン", "タリマルジャン",
  "カラカルパクスタン", "ヌクス", "ホジェリ", "クンギラド", "タヒアタシュ",
  "ベルニー", "トゥルトクル", "チムバイ", "マンギト", "モイナク",
  "シュマナイ", "ハルカバード", "ブスタン",

  //https://ja.wikipedia.org/wiki/%E3%82%A6%E3%82%BA%E3%83%99%E3%82%AD%E3%82%B9%E3%82%BF%E3%83%B3%E3%81%AE%E5%9C%B0%E6%96%B9%E8%A1%8C%E6%94%BF%E5%8C%BA%E7%94%BB
  "タシュケント", "アンディジャン", "ブハラ", "フェルガナ",
  "ジザフ", "ナマンガン", "ナヴォイ", "カシュカダリヤ", "カルシ",
  "サマルカンド", "シルダリヤ", "グリスタン", "スルハンダリヤ", "テルメズ",
  "ホラズム", "ウルゲンチ", "カラカルパクスタン", "トルキスタン", "ブハラ・アミール",
  "ヒヴァ・ハン", "ロシア", "ウズベク・ソビエト", "ウズベキスタン", "トルキスタン・ソビエト",
  "ヒヴァ", "タジク", "タジク・ソビエト", "カラカルパク",

  //https://ja.wikipedia.org/wiki/%E3%82%BF%E3%82%B7%E3%83%A5%E3%82%B1%E3%83%B3%E3%83%88
  "ベクテミール", "チランザール", "ヤシュナバード", "ミラバード",
  "ミルザ・ウルグベク", "セルゲリ", "シャイハンターフル", "アルマザール", "ウチュテパ",
  "ヤッカサライ", "ユヌサバード",

  //https://ja.wikipedia.org/wiki/%E3%82%A2%E3%83%B3%E3%83%87%E3%82%A3%E3%82%B8%E3%83%A3%E3%83%B3%E5%B7%9E
  "ウズベク", "アンディジャン", "クイガンヤール", "アサカ",
  "バリクチ", "ボズ", "ブラクバシ", "イズバスカン", "パイトゥグ",
  "ジャラクドゥク", "アフンババイェフ", "ホジャーバード", "クルガンテパ", "マルハマト",
  "アルティンクル", "パフターバード", "シャフリハン", "ウルグノール", "アカルティン",
  "ハナバード", "カラスウ",

  //https://ja.wikipedia.org/wiki/%E3%83%96%E3%83%8F%E3%83%A9%E5%B7%9E
  "アラト", "ブハラ", "ガラーシヤ", "ギジュドゥヴァン",
  "ジャンダル", "カガン", "カラクル", "カラウールバザール", "ペシュク",
  "ヤンギバザール", "ロミタン", "シャフィルカン", "ヴァブケント", "ガズリ",

  //https://ja.wikipedia.org/wiki/%E3%83%95%E3%82%A7%E3%83%AB%E3%82%AC%E3%83%8A%E5%B7%9E
  "アルティアリク", "バグダード", "ベシャリク", "ブヴァイダ",
  "イブラト", "ダンガラ", "フェルガナ", "ヴァディル", "フルカト",
  "ナフバホール", "クシュテパ", "ランガル", "クヴァ", "リシュタン",
  "ソフ", "ラヴァン", "タシュラク", "ウチュクプリク", "ウズベキスタン",
  "ヤイパン", "ヤズヤヴァン", "コーカンド", "マルギラン", "クヴァサイ",

  //https://ja.wikipedia.org/wiki/%E3%82%B8%E3%82%B6%E3%83%95%E5%B7%9E
  "アルナサイ", "ゴリブラル", "バフマル", "ウスマト",
  "ドゥストリク", "ファリシュ", "ヤンギキシュラク", "ガルリャアラル", "ジザフ",
  "ウチュテパ", "ミルザチュル", "ガガーリン", "パフタコール", "ヤンギアーバード",
  "バランドチャキル", "ザーミン", "ザファラバード", "ザルブダール",

  //https://ja.wikipedia.org/wiki/%E3%83%8A%E3%83%9E%E3%83%B3%E3%82%AC%E3%83%B3%E5%B7%9E
  "チャルタク", "チュスト", "カサンサイ", "ミングブラク",
  "ジャマシュイ", "ナマンガン", "タシュブラク", "ナリン", "ハックラーバード",
  "パプ", "トゥラクルガン", "ウチュクルガン", "ウイチ", "ヤンギクルガン",

  //https://ja.wikipedia.org/wiki/%E3%83%8A%E3%83%B4%E3%82%A9%E3%82%A4%E5%B7%9E
  "カニメフ", "カルマナ", "キズィルテパ", "ハティルチ",
  "ヤンギラーバード", "ナフバホール", "ベシュラバード", "ヌラタ", "タムディ",
  "タムディブラク", "ウチュクドゥク", "ナヴォイ", "ザラフシャン",

  //https://ja.wikipedia.org/wiki/%E3%82%AB%E3%82%B7%E3%83%A5%E3%82%AB%E3%83%80%E3%83%AA%E3%83%A4%E5%B7%9E  
  "チラクチ", "デフカナバード", "カラシナ", "グザル",
  "カマシ", "カルシ", "ベシュケント", "カサン", "カスビ",
  "ムグラン", "キタブ", "ミリシュコール", "ヤンギ・ミリシュコール", "ムバレク",
  "ニシャン", "ヤンギ・ニシャン", "シャフリサブズ", "ヤッカバグ", "シャフリサブス",
  "タリマルジャン",

  //https://ja.wikipedia.org/wiki/%E3%82%B5%E3%83%9E%E3%83%AB%E3%82%AB%E3%83%B3%E3%83%89%E5%B7%9E
  "ブルングル", "イシュティハン", "ジャムバイ", "カッタクルガン",
  "パイシャンバ", "クシュラバート", "ナルパイ", "アクタシュ", "ヌラバード",
  "アクダリヤ", "ライシュ", "パフタチ", "ジヤウーディン", "パヤリク",
  "パストダルガム", "ジュマ", "サマルカンド", "グラバード", "タイラク",
  "ウルグト", "チェレク",

  //https://ja.wikipedia.org/wiki/%E3%82%B7%E3%83%AB%E3%83%80%E3%83%AA%E3%83%A4%E5%B7%9E
  "アカルティン", "サルドバ", "バヤウート", "グリスタン",
  "デフカナバード", "ハヴァス", "ミルザーバード", "ナフルーズ", "パフターバード",
  "サイフナーバード", "サイフン", "シルダリヤ", "ヤンギイェル", "シリン",
  "バフト",

  //https://ja.wikipedia.org/wiki/%E3%82%B9%E3%83%AB%E3%83%8F%E3%83%B3%E3%83%80%E3%83%AA%E3%83%A4%E5%B7%9E
  "アンゴル", "バンディハン", "バイスン", "デナウ",
  "ジャルクルガン", "キジリク", "サリク", "クムクルガン", "ムズラバート",
  "ハルカバード", "アルティンサイ", "カルルク", "サリアシヤ", "シェラバード",
  "シュルチ", "テルメズ", "ウズン",

  //https://ja.wikipedia.org/wiki/%E3%82%BF%E3%82%B7%E3%83%A5%E3%82%B1%E3%83%B3%E3%83%88%E5%B7%9E
  "ベカバード", "ザファル", "ブスタンリク", "ガザルケント",
  "ブカ", "チナズ", "キブライ", "アハンガラン", "アックルガン",
  "パルケント", "ピスケント", "クイーチルチク", "ドゥスタバード", "タシュケント",
  "ケレス", "ウルタチルチク", "トイテパ", "ヤンギユル", "ユカリチルチク",
  "ヤンギバザール", "ザンギアタ", "エシャングザル", "チルチク", "アングレン",
  "アルマリク",

  //https://ja.wikipedia.org/wiki/%E3%83%9B%E3%83%A9%E3%82%BA%E3%83%A0%E5%B7%9E
  "バガト", "グルレン", "ハンカ", "ハザラスプ",
  "ヒヴァ", "クシュクピル", "シャヴァト", "ウルゲンチ", "カラウール",
  "ヤンギアリク", "ヤンギバザール",

  //https://ja.wikipedia.org/wiki/%E3%82%AB%E3%83%A9%E3%82%AB%E3%83%AB%E3%83%91%E3%82%AF%E3%82%B9%E3%82%BF%E3%83%B3%E5%85%B1%E5%92%8C%E5%9B%BD
  "アムダリオ", "ベルニイ",
  "チンボイ", "エリクカラ", "ケゲイリ", "モイナク", "ヌクス",
  "カンリコリ", "コンギラト", "カラウーザク", "シュマナイ", "タフタクピル",
  "トゥルトクリ", "カラカルパク", "ホジェリ",
];

const list = [...new Set(temp).keys()];


export { list as uzbekistan };