import { SentenceGenerator } from "./interface/SentenceGenerator";

class TestGenerator extends SentenceGenerator {
  async generate() {
    return `Chi'erdong Guは象を使ってハンカチをかざし、そのハンカチに岳子潤の存在を実際に約束すると誓いました。心の知性と商エルの多くの人々は、Zuoが彼の運命を遅らせる先頭に立って島に現れたと考え、言及しました。その結果、軒には月があり、宮殿には十分なスペースがあるため、張貴基と東の人々によって状況を視察されます。あなたは物事の元の知識についてです、関富は重いです、そしてルーファの生命体は眠っている庭の水がまれな変化にすぎないことに気づきました 年、花とカラスのせいで、私は状態についてコメントするためにドゥアンディとファウーを使用していませんが、美しい果物、恨み、思いやりもトンデフのパートナーの世界で彼が愛するものに関連しています。確かに、薛子芬の師である薛子迪が宝くじのモデルに入り、師家石家に呼び出され、鼻を振られて回数を数えた。柔らかいものを見て泥棒になり、人生の終わりに物事を政治的批判と呼んだ場合、彼は自分を律することに注意を払う必要があります。しかし、私が出てきたとき、イタリアの波を守るためにイタリアのチームに入った。彼らは同じレベルにあり、常にお互いに8人を買うチャンスを与えていたディーラーは本当にチームではなかった。過去と現在を襲い、神を減らして家族となり、血を引く語り部の山があるという。ここの人々はよくここの騎兵に9章で軍隊に行くと言いたがります、そして方成斉が禁止を聞くことが許されないなら、彼は方方の戦場の痕跡を撃ちます、彼はグオモが地点まで進みたいと感じています。それを見ると、それは特定の健康の主なブレスマークである女性またはマスターの冷たい影への口頭反応の3番目の治療です。彼は故郷に戻り、息子のディンラが欲しいと助けを求めます。`;
  }
}

export { TestGenerator };